# GetInstanceGeometry Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
GeometryInstance..::..GetInstanceGeometry Method
GeometryInstance Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetInstanceGeometry()()()() | Computes the geometric representation of the instance. |
| GetInstanceGeometry(Transform) | Computes a transformation of the geometric representation of the instance. |

# See Also
GeometryInstance Class
GeometryInstance Members
Autodesk.Revit.DB Namespace